privacy/app/Http/Controllers/HomeController.php

    public function index()
    {
        $lokasi = auth()->user()->kode_lokasi;
        $company = auth()->user()->kode_company;

        $joborder_open = Joborder::where('status','1')->get();
        $leng = $joborder_open->count();

        $truck_open = Trucking::where('status','OPEN')->get();
        $leng2 = $truck_open->count();

        $trucknon_open = Truckingnon::where('status','OPEN')->get();
        $leng3 = $trucknon_open->count();

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');

        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
---
select * from `job_order` where `status` = '1'
select * from `trucking` where `status` = 'OPEN'
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1

                ->get();
        $leng4 = $user_login->count();

        $user_login2 = User::select('users.name')
                ->where('users.kode_company',auth()->user()->kode_company)
                ->get();

        $chat = Chat::join('users', 'users_chat.to_id', '=', 'users.id')
                ->get();
---
select `users`.`name` from `users` where `users`.`kode_company` = '02'
select * from `users_chat` inner join `users` on `users_chat`.`to_id` = `users`.`id`