privacy/app/Http/Controllers/InsentifoperatorController.php

select `nama_company`, `kode_company` from `company`
select `nama_kapal`, `kode_kapal` from `kapal` where `type` = 'Tug Boat' or `type` = 'MV'
select `nama_kapal`, `kode_kapal` from `kapal` where `type` = 'Tongkang'
select `id`, concat(nama_operator,' ~ ',nik) as namas from `operator` where `status_insentif` = '1'
select `nama_vendor`, `id` from `vendor`
select `type_cargo`, `id` from `type_cargo`
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function index()
    {
        $create_url = route('joborder.create');
        $Company = Company::pluck('nama_company','kode_company');
        $Kapal = Kapal::on('mysqlinvpbm')->where('type','Tug Boat')->orwhere('type','MV')->pluck('nama_kapal','kode_kapal');
        $Tongkang = Kapal::on('mysqlinvpbm')->where('type','Tongkang')->pluck('nama_kapal','kode_kapal');
        $Operator = Operator::select('id', DB::raw("concat(nama_operator,' ~ ',nik) as namas"))->where('status_insentif', '1')->pluck('namas','id');
        $Vendor = Vendor::pluck('nama_vendor','id');
        $Cargo = TypeCargo::pluck('type_cargo','id');

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();