privacy/app/Http/Controllers/JoborderController.php

select `nama_company`, `kode_company` from `company`
select `nama_kapal`, `kode_kapal` from `kapal` where `type` <> 'Tongkang'
select `nama_kapal`, `kode_kapal` from `kapal` where `type` = 'Tongkang'
select `nama_customer`, `id` from `customer` where `status` = 'Aktif'
select `nama_customer`, `id` from `customer` where `status` = 'Aktif' and `jenis_cust` = 'INF'
select `nama_vendor`, `id` from `vendor`
select `type_cargo`, `id` from `type_cargo`
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function index()
    {
        $create_url = route('joborder.create');
        $Company = Company::pluck('nama_company','kode_company');
        $Kapal = Kapal::on('mysqlinvpbm')->where('type','<>','Tongkang')->pluck('nama_kapal','kode_kapal');
        $Tongkang = Kapal::on('mysqlinvpbm')->where('type','Tongkang')->pluck('nama_kapal','kode_kapal');
        $Customer = Customer::where('status','Aktif')->pluck('nama_customer','id');
        $CustomerInf = Customer::where('status','Aktif')->where('jenis_cust','INF')->pluck('nama_customer','id');
        $Vendor = Vendor::pluck('nama_vendor','id');
        $Cargo = TypeCargo::pluck('type_cargo','id');
        $TypeJo = TypeInv::groupBy('type_inv')->groupBy('type_desc')->pluck('type_desc','type_inv');

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();

select `kode_size`, concat(kode_size,' - ',nama_size) as sizes from `size_container`
select `kode_alat`, concat(nama_alat,' ~ ',no_asset_alat,' ~ ',merk) as alats from `alat`
select `id`, concat(nama_operator,' ~ ',nik) as namas from `operator`
select `id`, concat(nama_helper,' ~ ',nik) as namas from `helper`
select `kode_mobil`, concat(nopol,' ~ ',no_asset_mobil) as mobils from `mobils`
select `nama_sopir`, `id` from `sopir`
select `nama_lokasi`, `kode_lokasi` from `master_lokasi`
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function detail3($joborder)
    {
        $joborder = Joborder::find($joborder);
        $no_joborder = $joborder->no_joborder;

        $Size = Sizecontainer::select('kode_size', DB::raw("concat(kode_size,' - ',nama_size) as sizes"))->pluck('sizes','kode_size');

        $Alat = Alat::select('kode_alat', DB::raw("concat(nama_alat,' ~ ',no_asset_alat,' ~ ',merk) as alats"))->pluck('alats','kode_alat');
        $Operator = Operator::select('id', DB::raw("concat(nama_operator,' ~ ',nik) as namas"))->pluck('namas','id');
        $Helper = Helper::select('id', DB::raw("concat(nama_helper,' ~ ',nik) as namas"))->pluck('namas','id');
        $Mobil = Mobil::select('kode_mobil', DB::raw("concat(nopol,' ~ ',no_asset_mobil) as mobils"))->pluck('mobils','kode_mobil');
        $Sopir = Sopir::pluck('nama_sopir','id');

        $Lokasi = MasterLokasi::pluck('nama_lokasi','kode_lokasi');

        $list_url= route('joborder.index');
        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();