privacy/app/Http/Controllers/LaporanrekapalatController.php

select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
---
    public function index()
    {
        $create_url = route('laporanrekapalat.create');
        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();