privacy/app/Http/Controllers/PemakaianAlatDetailController.php

select * from `spk` where `no_spk` = '02SPK220900456' limit 1
select * from `alat` where `alat`.`kode_alat` = '158' limit 1
select * from `operator` where `operator`.`id` = 89 limit 1
---
    public function cekspk()
    {
        $no_spk = request()->no_spk;
        $spk = Spk::where('no_spk', $no_spk)->first();

        if ($spk != null) {
            //Ambil Nama
            $alat = Alat::find($spk->kode_alat);
            $operator = Operator::find($spk->operator);

select * from `pemakaian_alat_detail` where `no_pemakaian` = '02PSA220900052' order by `no_timesheet` asc limit 1
select * from `pemakaian_alat_detail` where `no_pemakaian` = '02PSA220900052' order by `no_timesheet` asc
select * from `pemakaian_alat_detail` where `no_timesheet` = '22036009' limit 1
---
    public function cekts()
    {
        $no_pemakaian = request()->no_pemakaian;
        $awalan = PemakaianAlatDetail::where('no_pemakaian', $no_pemakaian)->orderBy('no_timesheet','asc')->first();
        $detail = PemakaianAlatDetail::where('no_pemakaian', $no_pemakaian)->orderBy('no_timesheet','asc')->get();
        $timesheet = $awalan->no_timesheet;
        foreach ($detail as $row) {
            if ($timesheet == $row->no_timesheet) {
                $tanda = PemakaianAlatDetail::where('no_timesheet', $row->no_timesheet)->first();

select * from `pemakaian_alat` where `pemakaian_alat`.`no_pemakaian` = '02PSA220900052' limit 1
select * from `spk` where `no_joborder` = '02JOB220900161' limit 1
select * from `tanggal_setup` where `tanggal_setup`.`id` = 1 limit 1
---
    public function store(Request $request)
    {
        $head = PemakaianAlat::find($request->no_pemakaian);
        $datetime1 = new DateTime($head->tgl_pemakaian);
        $datetime2 = new DateTime($request->tgl_pakai);

        $diff = $datetime1->diff($datetime2);
        $hari = $diff->d;

        //PROTEKSI APABILA JOB MEMILIKI SPK MAKA NOMOR SPK HARUS DIISI
        $cekjob = Spk::where('no_joborder', $head->no_joborder)->first();
        if ($cekjob != null) {
            if ($request->no_spk == null){
                $message = [
                    'success' => false,
                    'title' => 'Update',
                    'message' => 'Job ini memiliki SPK, SPK tidak boleh kosong.'
                ];
                return response()->json($message);
            }
        }

        //SETUP BATAS INPUT TANGGAL PAKAI ALAT
        $limit = TanggalSetup::find(1);

select * from `spk` where `no_spk` = '02SPK220900456' limit 1
---

        //PROTEKSI APABILA INPUT NOMOR SPK MAKA ALAT OPERATOR HELPER TIDAK BOLEH DIUBAH.
        if ($request->no_spk != null){
            $cekspk = Spk::where('no_spk', $request->no_spk)->first();