privacy/app/Http/Controllers/PemakaianAlatController.php

select `nama_company`, `kode_company` from `company`
select `nama_customer`, `id` from `customer` where `status` = 'Aktif'
select `no_joborder`, `no_joborder` from `job_order` where `status` <> '1'
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function index()
    {
        $create_url = route('pemakaianalat.create');
        $Company = Company::pluck('nama_company','kode_company');

        $Customer = Customer::where('status','Aktif')->pluck('nama_customer','id');
        $Joborder = Joborder::where('status','<>','1')->pluck('no_joborder','no_joborder');

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();

select * from `pemakaian_alat_detail` where `no_pemakaian` = '02PSA220900052' order by `created_at` desc
select `kode_alat`, concat(nama_alat,' ~ ',no_asset_alat,' ~ ',merk) as alats from `alat` where `status` = 'Aktif'
select `id`, concat(nama_operator,' ~ ',nik) as namas from `operator`
select `id`, concat(nama_helper,' ~ ',nik) as namas from `helper`
select `no_spk`, `no_spk` from `spk` where `no_joborder` = '02JOB220900161'
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function detail($joborder)
    {
        $pemakaian = PemakaianAlat::find($joborder);
        $no_pemakaian = $pemakaian->no_pemakaian;

        $tgl = $pemakaian->tgl_pemakaian;
        $tahun = Carbon\Carbon::createFromFormat('Y-m-d',$tgl)->year;
        $bulan = Carbon\Carbon::createFromFormat('Y-m-d',$tgl)->month;

        $cek_bulan2 = tb_akhir_bulan::where('status_periode','Open')->orwhere('reopen_status','true')->first();
        $tgl2 = $cek_bulan2->periode;
        $tahun2 = Carbon\Carbon::createFromFormat('Y-m-d',$tgl2)->year;
        $bulan2 = Carbon\Carbon::createFromFormat('Y-m-d',$tgl2)->month;

        $pemakaiandetail = PemakaianAlatDetail::where('no_pemakaian', $no_pemakaian)->orderBy('created_at','desc')->get();

        $Alat = Alat::select('kode_alat', DB::raw("concat(nama_alat,' ~ ',no_asset_alat,' ~ ',merk) as alats"))->where('status', 'Aktif')->pluck('alats','kode_alat');

        $Operator = Operator::select('id', DB::raw("concat(nama_operator,' ~ ',nik) as namas"))->pluck('namas','id');
        $Helper = Helper::select('id', DB::raw("concat(nama_helper,' ~ ',nik) as namas"))->pluck('namas','id');

        $Spk = Spk::where('no_joborder', $pemakaian->no_joborder)->pluck('no_spk','no_spk');
        $list_url= route('pemakaianalat.index');

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();