privacy/app/Http/Controllers/TruckingnonController.php

select `nama_company`, `kode_company` from `company`
select `no_joborder`, `no_joborder` from `joborder_detail`
select `no_joborder`, `no_joborder` from `job_order` where `job_order`.`type_jo` = '4' and `job_order`.`status` <> '1'
select `nama_customer`, `id` from `customer`
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function index()
    {
        $create_url = route('truckingnon.create');
        $Company = Company::pluck('nama_company','kode_company');
        $no_jo = JoborderDetail::pluck('no_joborder','no_joborder');
        // $Joborder = Joborder::whereNotIn('no_joborder',$no_truckingnon)->pluck('no_joborder','no_joborder');

        $Joborder = Joborder::where('job_order.type_jo','4')->where('job_order.status','<>', '1')->pluck('no_joborder','no_joborder');

        $Customer = Customer::pluck('nama_customer','id');

        $tgl_jalan = tb_akhir_bulan::where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();